app/views/users/showReport.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
            <td><%= post.updated_at %></td>
            <td><% user = User.find(post.user_id)%> <%= user.attributes['username']   %></td>

SELECT "votes".* FROM "votes" WHERE "votes"."post_id" = 2
---
            <td><%= link_to 'Show', post %></td>
            <% votes = Vote.find_all_by_post_id(post.id)