app/views/posts/_form.html.erb

         @categoryNames = []
         Category.all.each do |x|
---
SELECT "categories".* FROM "categories"