app/views/posts/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]
---
          <td><%= post.updated_at %></td>
          <td><% user = User.find(post.user_id)%> <%= user.attributes['username']   %></td>
          <td><% category = Category.find(post.category_id)  %>

SELECT "votes".* FROM "votes" WHERE "votes"."post_id" = 87
---
          <td><%= link_to 'Show', post %></td>
          <% votes = Vote.find_all_by_post_id(post.id)