app/views/posts/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "71"]]
---
    <th>Comments</th> <th>Commented by:</th> <th>Votes</th>
  <%@comments = Post.find(:all, :conditions => "id != #{@post.postid} and postid ==  #{@post.postid} and pcid==1") %>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---

        <td><% user = User.find(comments.user_id)%> <%= user.attributes['username']   %></td>

SELECT "votes".* FROM "votes" WHERE "votes"."post_id" = 8
---

        <% votes = Vote.find_all_by_post_id(comments.id)