app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    @post.user_id=session[:user_id]
    @post.pcid=0

    @post.weight=0
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("category_id", "created_at", "pcid", "post", "postid", "updated_at", "user_id", "weight") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def createComment

    @post = Post.find(session[:pid])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 71]]

  def comment

    @post = Post.new
    comment_text= params[:commenttext]
    comment_text = comment_text[0]
    @post.post = comment_text

    @post.postid = session[:pid]
    @post.user_id=session[:user_id]
    @post.pcid=1
    @post.weight=0

    parentPost = Post.find(session[:pid])
    @post.category_id = parentPost.category_id

    parentPost.weight+=1
    parentPost.save()
    respond_to do |format|
      if @post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 71]]
UPDATE "posts" SET "weight" = 2, "updated_at" = '2012-09-21 18:43:45.677022' WHERE "posts"."id" = 71
INSERT INTO "posts" ("category_id", "created_at", "pcid", "post", "postid", "updated_at", "user_id", "weight") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "81"]]
UPDATE "posts" SET "category" = '', "post" = 'should fix the bug', "updated_at" = '2012-09-22 00:59:44.676680' WHERE "posts"."id" = 83

  def destroy
    @post = Post.find(params[:id])
    #@posts= Post.find_by_sql("SELECT * FROM posts WHERE postid = '#@post[:id]]'")
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "85"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 85]]

  def incvote

    @vote = Vote.new()
    @vote.user_id = session[:user_id]
    @vote.post_id = params[:id]

    if @vote.save
      @post = Post.find(params[:id])
       @post.weight += 1
      @post.save()
---
INSERT INTO "votes" ("created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 21 Sep 2012 18:44:31 UTC +00:00], ["post_id", 76], ["updated_at", Fri, 21 Sep 2012 18:44:31 UTC +00:00], ["user_id", 7]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "76"]]
UPDATE "posts" SET "weight" = 1, "updated_at" = '2012-09-21 18:44:31.437297' WHERE "posts"."id" = 76

  def showvotes
    @users = []

    votes = Vote.find_all_by_post_id(params[:id])
---
SELECT "votes".* FROM "votes" WHERE "votes"."post_id" = 73