app/controllers/users_controller.rb

  def showAll
    @user = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(params[:user])

    @user.role = "User"
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "name", "password", "role", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 21 Sep 2012 18:58:35 UTC +00:00], ["name", "guri"], ["password", "12345"], ["role", nil], ["updated_at", Fri, 21 Sep 2012 18:58:35 UTC +00:00], ["username", "g"]]

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "users" SET "name" = 'test123', "role" = 'User', "updated_at" = '2012-09-29 06:06:37.276505' WHERE "users"."id" = 2

  def authenticate


    @user = User.new(params[:userform])
    #find records with username,password
    valid_user = User.where(:username=>@user.username, :password=>@user.password).first
---
SELECT "users".* FROM "users" WHERE "users"."username" IS NULL AND "users"."password" IS NULL LIMIT 1

  def showReport
    user = User.find(params[:id])
    @posts = Post.where(:user_id=>user.id)

    @votes= []
    @posts.each { |post|


    @votes.append (Vote.where(:post_id=>post.id).each)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1
SELECT "votes".* FROM "votes" WHERE "votes"."post_id" = 2