app/controllers/votes_controller.rb

SELECT "votes".* FROM "votes"
---
  def index
    @votes = Vote.all

SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def show
    @vote = Vote.find(params[:id])

SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @vote = Vote.find(params[:id])

INSERT INTO "votes" ("created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Tue, 02 Oct 2012 00:30:27 UTC +00:00], ["post_id", 298486374], ["updated_at", Tue, 02 Oct 2012 00:30:27 UTC +00:00], ["user_id", 980190962]]
---
  def create

    @vote = Vote.new(params[:vote])

    if !@vote.save then

SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @vote = Vote.find(params[:id])

SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 980190962]]
---
  def destroy
    @vote = Vote.find(params[:id])
    @vote.destroy